<template>
  <div>
    <div class="row" style="margin: 20px 5px;">
      <div class="col-0  col-sm-1   col-md-2  col-xl-3"></div>
      <div class="col-12 col-sm-10 col-md-8 col-xl-6 my-auto">
        <div class="section">
          <h3>個人情報の管理</h3>
          <div>個人情報を取り扱うにあたっては、「個人情報の保護に関する法律」をはじめとする個人情報の保護に関する法令、ガイドラインおよび本プライバシーポリシーを遵守いたします。</div>
        </div>
        
        <div class="section">
          <h3>個人情報の利用目的</h3>
          <div>{{ appName }}（以下、「当サイト」とします）では、訪問者様からのお問い合わせやコメントをお受けした際に、お名前（ハンドルネーム）、メールアドレス等の個人情報をご登録いただきます。</div>
          <div>これらの個人情報は質問に対する回答や必要な情報を電子メールなどをでご連絡する場合に利用させていただくものであり、個人情報をご提供いただく際の目的以外では利用いたしません。</div>
          <div>また、コメントを書きますとお名前がコメントともに一般公開されますのでご了承ください。</div>
        </div>

        <div class="section">
          <h3>個人情報の第三者への開示</h3>
          <div>当サイトでは、個人情報は適切に管理し、以下に該当する場合を除いて第三者に開示することはありません。</div>
          <div>・本人のご了解がある場合</div>
          <div>・法令等への協力のため、開示が必要となる場合</div>
        </div>

        <div class="section">
          <h3>個人情報の開示、訂正、追加、削除、利用停止</h3>
          <div>ご本人からの個人データの開示、訂正、追加、削除、利用停止のご希望の場合には、ご本人であることを確認させていただいた上、速やかに対応させていただきます。</div>
        </div>

        <div class="section">
          <h3>Cookie（クッキー）</h3>
          <div>当サイトでは、一部のコンテンツについて情報の収集にCookieを使用しています。</div>
          <div>Cookieは、ユーザーがサイトを訪れた際に、そのユーザーのコンピュータ内に記録されます。</div>
          <div>ただし、記録される情報には、ユーザー名やメールアドレスなど、個人を特定するものは一切含まれません。</div>
          <div>また、当サイトではユーザーの方々がどのようなサービスに興味をお持ちなのかを分析したり、ウェブ上での効果的な広告の配信のためにこれらを利用させていただく場合があります。</div>
        </div>

        <div class="section">
          <h3>当サイトが使用しているアクセス解析ツールについて</h3>
          <div>当サイトでは、Googleによるアクセス解析ツール「Googleアナリティクス」を利用しています。</div>
          <div>このGoogleアナリティクスはトラフィックデータの収集のためにCookieを使用しています。このトラフィックデータは匿名で収集されており、個人を特定するものではありません。この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認ください。この規約に関して、詳しくはこちらをご参照ください。</div>
        </div>

        <!-- <div class="section">
          <h3>当サイトの広告について</h3>
          <div>当サイトでは「Amazonアソシエイト」などのアフィリエイトプログラムや第三者配信広告サービス「GoogleAdsense」を利用しています。</div>
          <div>GoogleAdsenseでは広告配信プロセスにおいてデータを収集するために、Cookieを使用しています。GoogleでCookieを使用することにより、インターネットにおけるご自身のサイトや他のサイトへのアクセス情報に基づいてユーザーに広告を配信することが可能になります。</div>
          <div>Cookieを使用しないように設定するにはこちらをご参照ください。</div>
        </div> -->

        <div class="section">
          <h3>著作権について</h3>
          <div>当サイトに掲載されている情報についての著作権は放棄しておりません。</div>
          <div>著作権法により認められている引用の範囲である場合を除き「内容、テキスト、画像等」の無断転載・使用を固く禁じます。</div>
        </div>

        <div class="section">
          <h3>免責事項</h3>
          <div>当サイトからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。</div>
          <div>当サイトのコンテンツ・情報につきまして、可能な限り正確な情報を掲載するよう努めておりますが、誤情報が入り込んだり、情報が古くなっていることもございます。</div>
          <div>当サイトに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。</div>
        </div>

        <div class="section">
          <h3>プライバシーポリシーの変更について</h3>
          <div>当サイトは、個人情報に関して適用される日本の法令を遵守するとともに、本ポリシーの内容を適宜見直しその改善に努めます。</div>
          <div>修正された最新のプライバシーポリシーは常に本ページにて開示されます。</div>
        </div>

        <div class="section">
          <h3>お問い合わせ</h3>
          <div>当サイトへの、お問い合わせに関しては、ログイン後お問い合わせタブからどうぞ。</div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'PrivacyPolicyComponent',
  components: {
  },
  data() {
      return {
      }
  },
  computed: {
    appName: function() {
      return process.env.VUE_APP_NAME;
    }
  }
}
</script>

<style>
.section {
  margin: 1em auto;
}

ul, ol {
  padding-left: 1.5em;
}

h3 {
  margin: 0.7em auto 0em;
}
</style>